Config/InformationRegisters/CalendarDays.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CalendarDays</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CalendarDayType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Timetable</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Timetables</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PriceTag</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTags</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomPriceCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccountingDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/CalendarDayTypesAllowed.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CalendarDayTypesAllowed</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CalendarDayTypeFrom</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CalendarDayTypeTo</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CalendarDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Calendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/CalendarDays/Ext/RecordSetModule.bsl
#Region EventHandlers

// --------------------------------------------------------------------------------
Procedure BeforeWrite(pCancel, pReplacing)    
	If DataExchange.Load Or SessionParameters.UpdateInProgress Then
		Return;
	EndIf;  
	
	// Check delete or change record  
	If ThisObject.Count() = 0 Then      
		vAccountingDate = ThisObject.Filter.AccountingDate.Value;
		If vAccountingDate <> '00010101' Then
			vCalendar = ThisObject.Filter.Calendar.Value;
			vPeriod = ThisObject.Filter.Period.Value;
			If RatesManagement.IsRoomRateInUse(vPeriod, , , , vCalendar) Then
				pCancel = True;  
				If ThisObject.Modified() Then
					// It`s delete row
					vErrMsg = StrTemplate(NStr("en = 'You cannot delete the line for %1 to %2. because We have reservations!'; 
											   |de = 'Sie können die Zeile %1 nicht in %2 ändern. Weil Wir haben Reservierungen!'; 
											   |ru = 'Нельзя удалить строку для %1 от %2. т.к. есть бронирования!'"), vCalendar, vPeriod);   
					tcCommonFunctionOnClientServer.UserMessage(vErrMsg);    
				EndIf;
				Return;
			EndIf;	
		EndIf;	
	EndIf;
	
	For Each vRcd In ThisObject Do
		// Try to find restrictions data for this date
		vPeriod = BegOfDay(vRcd.Period);
		If vPeriod <> '20000101' Then
			vAccountingDate = vRcd.AccountingDate;
			vCalendar = vRcd.Calendar;
			vCalendarDayType = vRcd.CalendarDayType;
			If ValueIsFilled(vCalendarDayType) Then
				vWeight = vCalendarDayType.Weight;
				vQry = New Query();
				vQry.Text = 
				"SELECT
				|	CalendarDayTypesAllowed.Period AS Period,
				|	CalendarDayTypesAllowed.Calendar AS Calendar,
				|	CalendarDayTypesAllowed.RoomType AS RoomType,
				|	CalendarDayTypesAllowed.Hotel AS Hotel,
				|	CalendarDayTypesAllowed.CalendarDayTypeFrom.Parent AS DayTypeParent,
				|	CalendarDayTypesAllowed.CalendarDayTypeFrom.Weight AS WeightFrom,
				|	CalendarDayTypesAllowed.CalendarDayTypeTo.Weight AS WeightTo
				|FROM
				|	InformationRegister.CalendarDayTypesAllowed AS CalendarDayTypesAllowed
				|WHERE
				|	CalendarDayTypesAllowed.Calendar = &qCalendar
				|	AND CalendarDayTypesAllowed.Period = &qPeriod
				|	AND CalendarDayTypesAllowed.RoomType = &qEmptyRoomType";
				vQry.SetParameter("qCalendar", vCalendar);
				vQry.SetParameter("qPeriod", vAccountingDate);
				vQry.SetParameter("qEmptyRoomType", Catalogs.RoomTypes.EmptyRef());
				vRestrictions = vQry.Execute().Unload();
				For Each vRestrictionsRow In vRestrictions Do
					If vRestrictionsRow.WeightFrom > vWeight Or vRestrictionsRow.WeightTo < vWeight Or vRestrictionsRow.DayTypeParent <> vCalendarDayType.Parent Then
						pCancel = True;  
						vErrMsg = NStr("en = 'Day type is not in the list of allowed day types!'; 
						               |de = 'Tag-Typ ist nicht in der Liste der zulässigen Tag-Typen!'; 
						               |ru = 'Тип дня не входит в список разрешенных типов дней!'");
						tcCommonFunctionOnClientServer.UserMessage(vErrMsg);
						Return;
					EndIf;
				EndDo;
			EndIf;
		EndIf;
	EndDo;
EndProcedure // BeforeWrite

// --------------------------------------------------------------------------------
Procedure OnWrite(pCancel, pReplacing)  
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure // OnWrite

#EndRegion
